---
kind: property
id: P:Autodesk.Revit.UI.UIApplication.Application
source: html/ef60b8a9-75b6-a227-f991-55d73ef0c695.htm
---
# Autodesk.Revit.UI.UIApplication.Application Property

Returns the database level Application represented by this UI level Application.

## Syntax (C#)
```csharp
public Application Application { get; }
```